
//@skip-check module-region-empty
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		ТекстСообщения = НСтр("ru = 'Перед записью необходимо заполнить склад.'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Склад", "Объект", Отказ);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаФилиала = Объект.Дата + Объект.СмещениеВремениСклада;  
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ДатаФилиала = Объект.Дата + Объект.СмещениеВремениСклада;  
КонецПроцедуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Объект.СмещениеВремениСклада = 3600 * гваОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Склад, "ВременноеСмещение");
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаФилиала = Объект.Дата + Объект.СмещениеВремениСклада;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаФилиалаПриИзменении(Элемент)
	Объект.Дата = ДатаФилиала - Объект.СмещениеВремениСклада; 
КонецПроцедуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиКомандФормы
#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции
#КонецОбласти
